; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 278232 2 1 3 7 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	image2 - mode
	thermograph1 - mode
	infrared0 - mode
	Star0 - direction
	Star2 - direction
	Star5 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
)
(:init
	(supports instrument0 infrared0)
	(supports instrument0 image2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 Star1)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star11)
	(supports instrument1 infrared0)
	(supports instrument1 thermograph1)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star5)
)
(:goal (and
	(have_image Phenomenon7 image2)
	(have_image Star8 infrared0)
	(have_image Planet9 image2)
	(have_image Planet10 image2)
	(have_image Star11 image2)
	(have_image Star12 thermograph1)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 6
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 groundstation3 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 6
4. (turn_to satellite1 star12 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star12)
   goals met: 0 of 6
5. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 6
6. (turn_to satellite1 star11 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star11)
   goals met: 0 of 6
7. (turn_to satellite0 star8 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star8)
   goals met: 0 of 6
8. (turn_to satellite1 planet9 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet9)
   goals met: 0 of 6
9. (take_image satellite0 star8 instrument0 infrared0)
   added: (have_image star8 infrared0)
   goals met: 1 of 6
10. (turn_to satellite1 star11 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star11)
   goals met: 1 of 6
11. (turn_to satellite0 star12 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star12)
   goals met: 1 of 6
12. (turn_to satellite1 planet10 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 planet10)
   goals met: 1 of 6
13. (take_image satellite0 star12 instrument0 thermograph1)
   added: (have_image star12 thermograph1)
   goals met: 2 of 6
14. (turn_to satellite1 star11 planet10)
   deleted: (pointing satellite1 planet10)
   added: (pointing satellite1 star11)
   goals met: 2 of 6
15. (turn_to satellite0 planet9 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 planet9)
   goals met: 2 of 6
16. (turn_to satellite1 phenomenon7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon7)
   goals met: 2 of 6
17. (take_image satellite0 planet9 instrument0 image2)
   added: (have_image planet9 image2)
   goals met: 3 of 6
18. (turn_to satellite1 star11 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star11)
   goals met: 3 of 6
19. (turn_to satellite0 planet10 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet10)
   goals met: 3 of 6
20. (turn_to satellite1 phenomenon7 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 phenomenon7)
   goals met: 3 of 6
21. (turn_to satellite1 star4 phenomenon7)
   deleted: (pointing satellite1 phenomenon7)
   added: (pointing satellite1 star4)
   goals met: 3 of 6
22. (take_image satellite0 planet10 instrument0 image2)
   added: (have_image planet10 image2)
   goals met: 4 of 6
23. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 4 of 6
24. (calibrate satellite1 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 4 of 6
25. (take_image satellite0 star11 instrument0 image2)
   added: (have_image star11 image2)
   goals met: 5 of 6
26. (turn_to satellite1 phenomenon7 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 phenomenon7)
   goals met: 5 of 6
27. (take_image satellite1 phenomenon7 instrument1 image2)
   added: (have_image phenomenon7 image2)
   goals met: 6 of 6
